Revit 2027 API
ExternalServiceOptions.SupportActivation Property
 Indicates if the service supports activation/deactivation of the servers.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool SupportActivation { get; set; }
Public Property SupportActivation As Boolean
	Get
	Set
public:
property bool SupportActivation {
	bool get ();
	void set (bool value);
}
member SupportActivation : bool with get, set
Property Value
Boolean
Exceptions
Exception | Condition
ArgumentException |  When setting this property: A service that doesn't support activation should not be recordable and/or self-syncronizing.
Remarks
If this option is set to true servers can be activated/deactivated.
If this option is set to false, for a single-server only one server can be added(registered) and will be considered active. In case of a multi-server service multiple servers cand be added(registered) and all of them will be considered active. An attempt to activate/deactivate the servers will lead to an exception.
A service for which SupportActivation is set to false, can't be recordable and self-synchronizing.
See Also
Reference
ExternalServiceOptions Class
Autodesk.Revit.DB.ExternalService Namespace